EDTДоговоры_ПРОФ_демо/src/DataProcessors/НачалоРаботы/НачалоРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>НачалоРаботы</name>
</mdclass:DataProcessor>

EDTДоговоры_ПРОФ_демо/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <comment>Email ответственного</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <comment>Должность ответственного</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НавигационнаяСсылкаИнформационнойБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВДокументах</name>
    <comment>Представление ответственного в документах</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексНумерации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Клиенты</name>
    <attributes>
      <name>ИдентификаторКлиента</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КаталогПрограммы</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDTДоговоры_ПРОФ_демо/src/DataProcessors/НачалоРаботы/Forms/ВводПервогоПользователя/Module.bsl
&НаКлиенте
Процедура Готово(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьПервогоПользователя();	
	
	ПараметрыЗапуска = "/N" + Логин;
	Если Не ПустаяСтрока(Пароль) Тогда
		ПараметрыЗапуска = ПараметрыЗапуска + " /P" + Пароль;
	КонецЕсли;	
	ЗавершитьРаботуСистемы(Ложь, Истина, ПараметрыЗапуска);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПервогоПользователя()
	
	Пользователь = Справочники.Пользователи.СоздатьЭлемент();
	
	Админ = ПользователиИнформационнойБазы.СоздатьПользователя();
	
	Админ.АутентификацияСтандартная = Истина;
	Админ.Имя = Логин;
	Админ.ПолноеИмя = ФИО;
	Админ.РежимЗапуска = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение;
	Админ.Роли.Добавить(Метаданные.Роли.АдминистраторСистемы);
	Админ.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
	Админ.Роли.Добавить(Метаданные.Роли.Пользователь);
	Админ.Пароль = Пароль;
	
	Админ.Записать();
	
	Пользователь.Наименование = ФИО;
	Пользователь.АдресЭлектроннойПочты = Email;
	Пользователь.Должность = Должность;
	Пользователь.ПредставлениеВДокументах = ВДокументах;
	Пользователь.ИдентификаторПользователяИБ = Админ.УникальныйИдентификатор;
	Пользователь.Записать();
	
КонецПроцедуры		

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации() Тогда
		Элементы.ДекорацияЗаголовокПроф.Видимость = Ложь;
		Элементы.ДекорацияПользователиПотомПроф.Видимость = Ложь;
	Иначе	
		Элементы.ДекорацияЗаголовокБазовая.Видимость = Ложь;
		Элементы.ДекорацияПользователиПотомБазовая.Видимость = Ложь;
	КонецЕсли;	
	
	Элементы.Email.ОтметкаНезаполненного = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ФИОПриИзменении(Элемент)
	
	Логин = ПользователиСлужебныйКлиентСервер.ПолучитьКраткоеИмяПользователяИБ(ФИО);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	ЗавершитьРаботуСистемы();

КонецПроцедуры
